Name Property
 Set the name for the ElementType.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override string Name { set; }
  Visual Basic
Public Overrides WriteOnly Property Name As String
	Set
  Visual C++
public:
virtual property String^ Name {
	void set (String^ value) override;
}
 Remarks
 This method will assign the element type a new name.
 See Also
  ElementType Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →